<template>
  <div v-if="isVisible" class="modal-overlay" @click="closeOnOverlayClick">
    <div class="modal-content" @click.stop>
      <button class="modal-close" @click="closeModal">X</button>
      <h1 class="modal-content__title">Политика Конфиденциальности</h1>
      <div class="modal-wrapper">
        <p>
          1. Данная Политика конфиденциальности (в дальнейшем – Политика) распространяется на всю
          информацию, включая персональные данные в соответствии с применимым законодательством (в
          дальнейшем – «Персональная информация»), которую PAYMALL.RU (далее – «Paymall») может
          получить о вас при использовании вами любых сайтов, программ, продуктов и/или сервисов
          Paymall (в дальнейшем вместе – «Сервисы»). Также она охватывает информацию, которую вы
          предоставляете на Сайте Paymall.ru (в дальнейшем – «Сайт») и других сайтах, принадлежащих
          Paymall (далее вместе – «Сайты»), а также информацию, полученную в ходе исполнения Paymall
          любых соглашений и договоров, заключенных с вами в связи с использованием Сервисов.
        </p>
        <h2>2. Общие положения</h2>
        <p>
          2.1. Paymall также может получать Персональную информацию от своих партнеров (в дальнейшем
          – «Партнеры»), сайты, программы, продукты или сервисы которых вы используете (например, от
          рекламодателей Paymall). В таких случаях передача Персональной информации возможна только
          в соответствии с применимым законодательством и осуществляется на основании специальных
          договоров между Paymall и каждым из Партнеров.
        </p>
        <p>
          2.2. Обратите внимание, что условия использования каждого из Сайтов и/или Сервисов могут
          дополнительно регулироваться дополнительными условиями, которые могут вносить изменения
          и/или дополнения в данную Политику, а также иметь свои специальные условия относительно
          персональной информации. Эти условия будут размещены в соответствующих разделах документов
          для таких Сайтов и/или Сервисов.
        </p>
        <p>
          2.3. Paymall при обработке персональных данных руководствуется нормами международного
          законодательства, а также законодательства стран СНГ и ЕС. Данная политика соответствует
          нормам локальных федеральных законов о персональных данных, а также закона ЕС 2016/679
          (GDPR).
        </p>
        <p>
          2.4. В случае внесения существенных изменений в Политику, мы сообщим вам об этом. Кроме
          того, Paymall может запросить ваше согласие на продолжение обработки персональных данных,
          даже если вы давали такое согласие ранее.
        </p>
        <p>
          2.5. Paymall приветствует ваши вопросы и предложения относительно исполнения или изменения
          настоящей Политики. Вы также можете связаться с нами по адресу электронной почты
          paymallcase@gmail.com, чтобы направить запросы, касающиеся реализации ваших прав или жалоб
          относительно некорректности вашей Персональной информации или незаконной обработки.
        </p>
        <h2>3. Цель данной политики</h2>
        <p>
          3.1. Одной из главных целей данной Политики является защита вашей Персональной информации
          и обеспечение вашей конфиденциальности. Paymall строго соблюдает применимое
          законодательство при обработке вашей Персональной информации во время использования вами
          Сайтов и Сервисов. Следуя нашим обязанностям по защите вашей Персональной информации, мы
          стремимся предоставить вам максимально прозрачную информацию о следующих важных аспектах:
        </p>
        <p>
          3.2. Мы собираем различные персональные данные, которые вы предоставляете нам или другим
          пользователям Сайта при оформлении заказов, отвечая на сообщения, принимая условия
          заказов, обсуждая детали транзакций и совершая другие действия, связанные с торговыми
          услугами и Сервисами нашего Сайта. Эти данные включают, но не ограничиваются, информацией
          вашей учетной записи, необходимой для доступа в личный кабинет, адресами электронной почты
          и др.
        </p>
        <p>
          3.3. При регистрации (создании учетной записи), заполнении форм (форма обратной связи) или
          обращении в службу поддержки на Сайте paymall.ru вы предоставляете персональную
          информацию, такую как ваше имя, адрес IP, адрес электронной почты и файлы cookie.
        </p>
        <p>
          3.4. Мы обрабатываем информацию о вашей активности при использовании Сайтов и/или
          Сервисов, включая данные о покупках в Сервисах, использовании самих Сервисов,
          взаимодействии с другими пользователями, а также файлы и контент, хранящиеся в системах
          Paymall. Это также включает ваши отзывы о нашей работе на сторонних сайтах и/или ресурсах,
          комментарии о качестве наших Служб и/или Сайта, а также любые данные, необходимые для
          успешного рассмотрения жалоб и работы службы арбитража.
        </p>
        <p>
          3.5. Нам очень важны успешное рассмотрение жалоб и корректная работа нашей службы
          арбитража, чтобы обеспечить вам наши услуги на должном уровне. В связи с этим, для
          полноценного рассмотрения ваших жалоб или жалоб, которые касаются вас, нам может
          понадобиться определенный набор персональных данных. Мы также оставляем за собой право
          использовать отдельные типы персональных данных, необходимых для защиты нашей
          предпринимательской репутации и бренда.
        </p>
        <p>
          3.6. Мы не собираем целенаправленно чувствительную персональную информацию (например,
          расовое происхождение, политические взгляды, информацию о здоровье и биометрические
          данные), за исключением случаев, предусмотренных законом.
        </p>
        <h2>4. Доступ к персональной информации</h2>
        <p>
          4.1. В рамках актуального законодательства, Paymall может передавать вашу Персональную
          информацию своим сотрудникам. Также мы можем передавать ее своим аффилированным лицам,
          включая третьи лица и службы, с которыми Paymall сотрудничает. Обратите внимание, что
          уровень защиты Персональной информации в некоторых странах может не соответствовать уровню
          в вашей юрисдикции, и, используя наши Сервисы и/или Сайт, вы соглашаетесь на такую
          передачу. К третьим лицам относятся инструменты веб-аналитики, такие как Яндекс.Метрика,
          Google Analytics и другие.
        </p>
        <p>
          4.2. Мы можем получать некоторые данные от третьих лиц, если это предусмотрено законом или
          требуется для выполнения наших договорных обязательств, например, ваши платежные данные
          (маска платежной карты).
        </p>
        <p>
          4.3. При обработке данных, полученных способом, указанным в п.п. 4.1, Paymall
          руководствуется нормами международного законодательства и законодательства стран ЕС и СНГ.
        </p>
        <h2>5. Правовая основа и цели обработки персональной информации</h2>
        <p>
          5.1. В дополнение к п.3. этой Политики, Paymall обрабатывает вашу Персональную информацию
          только в следующих случаях:
        </p>
        <p>
          5.1.1. Предоставление доступа к вашей учетной записи, включая настройки личного кабинета и
          другие инструменты нашего Сайта.
        </p>
        <p>
          5.1.2. Обработка необходима для выполнения договорных обязательств Paymall перед вами,
          включая обеспечение работы Сайтов и Сервисов.
        </p>
        <p>
          5.1.3. Обработка необходима для соблюдения установленных законодательством обязательств.
        </p>
        <p>
          5.1.4. Обработка необходима для улучшения качества наших услуг и/или для понимания, как вы
          взаимодействуете с нашими Сайтами и/или Сервисами.
        </p>
        <p>
          5.1.5. В случаях, когда это предусмотрено применимым законодательством, обработка
          необходима для обеспечения законных интересов Paymall только при условии, что такая
          обработка не оказывает существенного влияния и не наносит ущерб вашим интересам, правам и
          свободам.
        </p>
        <p>
          5.2. Для определенных целей или в соответствии с требованиями применимого законодательства
          мы можем запрашивать ваше отдельное согласие на обработку вашей Персональной информации.
          Для юрисдикций, где согласие признается отдельным правовым основанием, начало
          использования вами Сайтов и/или Сервисов Paymall подразумевает ваше согласие с такой
          обработкой. Мы информируем вас, а вы подтверждаете, что предоставление какой-либо
          Персональной информации при использовании Сайтов или Услуг является исключительно на вашей
          свободной воле. Вы также осознаете, что без предоставления Персональной информации мы не
          сможем предоставить вам возможность пользоваться Сервисами, и использование Сайтов будет
          ограничено.
        </p>
        <p>
          5.3. Paymall всегда обрабатывает вашу Персональную информацию только в целях, указанных в
          п.5., и только ту Персональную информацию, которая имеет отношение к достижению таких
          целей.
        </p>
        <p>
          5.4. Иногда Paymall может использовать технические решения, инструменты и сервисы третьих
          лиц (например, сервисы нашего платежного партнера). Данные решения, инструменты и сервисы
          могут обрабатывать ваши данные для целей, которые отличаются от тех, что указаны в п.5.
          данной Политики. Paymall не несет ответственности за практики обработки персональных
          данных третьих лиц.
        </p>
        <h2>6. Использование файлов cookie</h2>
        <p>
          6.1. Файлы cookie – это маленькие фрагменты данных с определенной (часто технической)
          информацией, которые сервер отправляет на ваше устройство, чтобы запомнить информацию о
          ваших предпочтениях. Данная информация используется Сайтом для анализа ваших действий и
          отображения Сайта в удобном для вас формате. Например, с помощью файла Cookie "locale" наш
          Сайт и прочие Сервисы предлагают вам просматривать информацию на том языке, которым вы
          обычно пользуетесь (или который вы самостоятельно выбрали).
        </p>
        <p>
          6.2. Paymall использует сессионные файлы cookie для предоставления вам более удобного
          использования нашими Сервисами. Срок действия сессионных файлов cookie истекает в конце
          сессии, когда вы закрываете страницу или окно браузера.
        </p>
        <h2>7. Хранение информации</h2>
        <p>
          7.1. Ваша Персональная информация будет храниться в соответствии с требованием локальных
          федеральных законов стран СНГ и ЕС.
        </p>
        <p>
          7.2. Для российских и белорусских пользователей: Paymall осуществляет запись,
          систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение
          персональных данных граждан Российской Федерации с использованием баз данных, находящихся
          на территории Российской Федерации.
        </p>
        <p>
          7.3. Если вы находитесь на территории, где для передачи вашей Личной информации в другую
          юрисдикцию требуется ваше согласие, то, используя Сайты или Сервисы Paymall, вы даете
          Paymall свое явное и однозначное согласие на такую передачу или хранение, и/или обработку
          информации в других указанных юрисдикциях, включая Россию.
        </p>
        <p>
          7.4. Paymall также использует соответствующие меры для обеспечения того, чтобы такая
          передача осуществлялась в соответствии с действующими правилами защиты данных ЕС и России
          (при передаче данных граждан России). Paymall также использует Стандартные договорные
          условия, разрешающие передачу вашей Персональной информации в Россию.
        </p>
        <p>
          7.5. Paymall хранит ваши данные в течение такого периода времени, который необходим для
          достижения цели, для которой они были собраны, или для соблюдения требований
          законодательства и нормативных актов.
        </p>
        <p>7.6. По истечении периода хранения ваши данные удаляются или анонимизируются.</p>
        <p>
          7.7. В случае, если ваши данные были собраны и обрабатываются на основе вашего согласия на
          обработку вашей персональной информации, мы удалим ваши данные без разрыва прочих
          юридических отношений, если вы отзовете ваше согласие. Ваш отказ не повлияет на ваш
          юридический статус, однако может ограничить доступный вам функционал на нашем Сайте и/или
          функционал наших Служб.
        </p>
        <h2>8. Права пользователя</h2>
        <p>
          8.1. В случае, если это предусмотрено применимым законодательством, вы имеете право на
          доступ к вашей Персональной информации, обрабатываемой Paymall в соответствии с настоящей
          Политикой.
        </p>
        <p>
          8.2. Если вы считаете, что какая-либо информация, которую Paymall хранит о вас,
          некорректная или неполная, вы имеете право потребовать от нас дополнения или исправления
          вашей информации.
        </p>
        <p>
          8.4. Вы можете потребовать удаления вашей персональной информации или ее части, а также
          отозвать согласие на обработку вашей персональной информации.
        </p>
        <p>8.5. Вы можете требовать ограничения на обработку вашей Персональной информации.</p>
        <p>
          8.6. Запросить копию Стандартных договорных условий, разрешающих передачу вашей
          Персональной информации в Россию и указанных в п.п. 7.5. настоящей Политики.
        </p>
        <p>
          8.7. Возражать против обработки вашей Персональной информации, если это предусмотрено
          применимым законодательством.
        </p>
        <p>
          8.8. В случаях, предусмотренных применимым законодательством, вы можете также обладать
          другими правами, не указанными выше.
        </p>
        <p>
          8.9. При использовании вами Сервисов передача Персональной информации осуществляется с
          вашего согласия, выражающего свободную волю и ваш интерес (в частности, на основании
          договора с вами), и не является обязанностью по закону.
        </p>
      </div>
    </div>
  </div>
</template>
<script setup lang="ts">
import { onBeforeUnmount, onMounted } from 'vue'

const props = defineProps({
  isVisible: { type: Boolean, default: false },
  closeOnOverlay: { type: Boolean, default: true },
})
const emit = defineEmits(['close'])

const closeModal = () => {
  emit('close')
}

const closeByKey = (e: KeyboardEvent) => {
  if (e.key === 'Escape') {
    closeModal()
  }
}

onMounted(() => {
  document.addEventListener('keydown', closeByKey)
})

onBeforeUnmount(() => {
  document.removeEventListener('keydown', closeByKey)
})

const closeOnOverlayClick = () => {
  if (props.closeOnOverlay) closeModal()
}
</script>

<style scoped lang="scss">
.modal-overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background: rgba(0, 0, 0, 0.5);
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 999;
}

.modal-wrapper {
  max-height: 50vh;
  overflow-y: scroll;

  h2 {
    font-size: 20px;
    margin-bottom: 12px;
    margin-top: 30px;

    &:first-child {
      margin-top: 0;
    }
  }

  p {
    margin-bottom: 8px;
  }
}

.modal-content {
  position: relative;
  background: #0f0f0f;
  padding: 20px;
  border-radius: 8px;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.2);
  max-width: 500px;
  width: 100%;

  &__title {
    text-align: center;
    font-size: 24px;
    font-family: Inter-Bold, sans-serif;
    margin-bottom: 20px;
  }
}

.modal-close {
  position: absolute;
  top: 15px;
  right: 15px;
  background: transparent;
  border: none;
  font-size: 16px;
  cursor: pointer;
  color: #fff;
  transition: opacity 0.15s ease-in;

  &:hover {
    opacity: 0.7;
  }
}
</style>
